#!/usr/bin/env python
# -*- coding:UTF-8 -*-
# XRLAM("Common.Other.EnumRoleStatus")
#===============================================================================
# 角色状态(一般是头顶上面的显示)(支持高频率变化)
# role.SetAppStatus()
#===============================================================================

#使用这个
#role.SetAppStatus(param)
#记得还原
#role.SetAppStatus(0)

#枚举定义
Nothing = 0 	#正常状态
Fighting = 1	#普通战斗中

GT_NPC = 2		#地精宝库特殊npc头顶状态

GW_CampStatus_1 = 3		#荣耀之战阵营1状态
GW_CampStatus_2 = 4		#荣耀之战阵营2状态
GW_CampStatusHead_1 = 5	#荣耀之战阵营1头顶状态
GW_CampStatusHead_2 = 6	#荣耀之战阵营2头顶状态

CT_Fighting = 7			#诸神之战战斗状态
CT_Dying = 8			#诸神之战死亡倒计时状态

LostScene_Find = 9		#迷失之境侦测到有人状态
LostScene_BeFind = 10	#迷失之境被人找到状态
LostScene_Apps_1 = 11	#迷失之境变身形象1
LostScene_Apps_2 = 12	#迷失之境变身形象2
LostScene_Apps_3 = 13	#迷失之境变身形象3

#===============================================================================
# 野外寻宝状态  100-120范围内玩家可点击战斗
#===============================================================================

#===============================================================================
# 深渊炼狱头顶状态  130 - 170
#===============================================================================
DeepHell_Apps_Begin = 130
DeepHell_Apps_End = 170

#===============================================================================
# 使用1000 - 2500区间用作婚礼ID  2000 - 2500(合服特殊处理ID)
#===============================================================================

#===============================================================================
#万圣节活动占用2501-2600，与CardBuff中的buffId直接对应
#===============================================================================

#===============================================================================
# 3000 - 4500区间用作结婚Party ID(4000-4500合服特殊处理)
#===============================================================================
