#!/usr/bin/env python
# -*- coding:UTF-8 -*-
# XRLAM("Game.SuperCards.EnumSuperCards")
#===============================================================================
# 至尊周卡一键收益枚举
#===============================================================================
DukeOnDuty 		= 1							#城主轮值
GloryWar 		= 2							#荣耀之战
DemonDefense 	= 3							#魔兽入侵
HunluanSapce 	= 4							#混乱时空
UnionFBSubstitute = 5						#公会副本
MDragonCome = 6								#魔龙降临
Shenshumijing = 7							#神树密境

MaxIndex = 8								#最大索引

#===============================================================================
# 100-200预留至尊周卡一键收益函数枚举
#===============================================================================
UnionGod 		= 100						#公会魔神
