#!/usr/bin/env python
# -*- coding:UTF-8 -*-
# XRLAM("Game.Slave.SlaveDefine")
#===============================================================================
# 日志信息
#===============================================================================


Log_1	= 1	#[抓捕]你抓捕{0}成功，获得奴隶
Log_2	= 2	#[抓捕]你抓捕{0}失败，没有获得奴隶
Log_3	= 3	#[抓捕]{0}抓捕你成功，你成为了他的奴隶
Log_4	= 4	#[抓捕]{0}抓捕你失败，你仍然是自由身
Log_5	= 5	#[抢夺] 你抢夺{0}的奴隶{1}成功，获得了他的奴隶{2}
Log_6	= 6	#[抢夺] 你抢夺{0}的奴隶失败，没有获得他的奴隶
Log_7	= 7	#[抢夺] {0}抢夺你的奴隶{1}成功，你失去了他
Log_8	= 8	#[抢夺] {0}抢夺你的奴隶{1}失败，他仍然是你的奴隶
Log_9	= 9	#[解救]你解救{0}的奴隶{1}失败，他依然是奴隶
Log_10	= 10	#[解救]你解救{0}的奴隶{1}成功，他恢复了自由身
Log_11	= 11	#[解救]{0}解救你的奴隶{1}失败，他依然是奴隶
Log_12	= 12	#[解救]{0}你解救你的奴隶{1}成功，你失去了他
Log_13	= 13	#[释放]你的主人{0}释放了你，你恢复了自由身
Log_14	= 14	#[释放]你释放了{0}，他恢复了自由身
Log_15	= 15	#[释放]你为主人{0}工作了24小时，恢复了自由身
Log_16	= 16	#[释放]你的奴隶{0}已为你工作了24小时，恢复了自由身
Log_17	= 17	#[反抗]：你反抗{0}成功了，你恢复了自由
Log_18	= 18	#[反抗]：你反抗{0}失败了，你仍是他的奴隶
Log_19	= 19	#[反抗]：你的奴隶{0}反抗你成功了，他战胜了你恢复了自由
Log_20	= 20	#[反抗]：你的奴隶{0}反抗你失败了，你战胜了他，他仍是你的奴隶
Log_21	= 21	#[求救]{0}解救你失败了，你依然是奴隶
Log_22	= 22	#[求救]{0}解救你成功了，你恢复了自由
Log_23	= 23	#[求救]{0}解救你的奴隶{1}失败了，他依然是奴隶
Log_24	= 24	#[求救]{0}解救你的奴隶{1}成功了，他恢复了自由

#主人和奴隶互动1
Log_25	= 25	#『互动』今天我开着宝马去带奴隶{0}去逛街，路上看到有群亲切的大叔在卖切糕。他说很想吃，我大手一挥说给你买，最后我和他抱着切糕走回家了，切糕真好吃啊。
Log_26	= 26	#『互动』主人{0}开着宝马带我去逛街，路上看到有群亲切的大叔在卖切糕。我说看着好好吃的样子，主人大手一挥说爷有钱，请你吃！最后主人瘸着腿捧着切糕回家了，切糕真好吃啊！

#主人和奴隶互动2
Log_27	= 27	#『互动』带奴隶{0}去泡温泉，一群基佬色迷迷地看着他可爱的小屁屁，于是我将一块肥皂扔在了地上，亲切地召唤他去拣。
Log_28	= 28	#『互动』主人{0}带我去泡了个温泉，别的都挺好，就是菊花好痛！真不该去拣那块肥皂的。

#奴隶和主人互动1
Log_29	= 29	#『互动』我对主人{0}说：你是电你是光你是唯一的神话！请让我舔你一口吧，舔哪里都行！
Log_30	= 30	#『互动』奴隶{0}趴在你的面前说：你是电你是光你是唯一的神话！请让我舔你一口吧，舔哪里都行！

#奴隶和主人互动2
Log_31	= 31	#『互动』我对主人0{}说，您太累了，要不要休息一下我给您按摩一下。放心好了，我祖传的卖烧饼的手艺，撒葱花擀面最拿手了。
Log_32	= 32	#『互动』奴隶{0}对我说，您太累了，要不要休息一下我给您按摩一下。放心好了，我祖传的卖烧饼的手艺，撒葱花擀面最拿手了。


mailTitle = "【抓奴隶】系统通知"
mainSender = "系统"
content_1 = "你的奴隶%s训练时间已满24小时，恢复成自由身，他在训练期间一共为你提供了%s经验"
content_2 = "你的奴隶坑%s被玩家%s成功的解救，恢复了自由身，他在训练期间一共为你提供了%s经验"
content_3 = "你的奴隶%s被玩家%s抢夺过去了，在训练期间他一共为你提供了%s经验"
content_4 = "你的奴隶%s成功反抗了你，恢复了自由身，在训练期间他一共为你提供了%s经验"

